mrdunk/esp8266_mqtt_kitchensink/src/http_server.cpp
  String table = tableStart() + rowStart("") +
                 header("") + header("service_name") + header("port") +
                 header("hostname") + header("ip") + header("service valid until") +
                 header("host valid until") + header("ipv4 valid until") +
                 header("success rate") +
                 rowEnd();
  Host* phost;
  bool active;
  while(brokers->IterateHosts(&phost, &active)){
    if(active){
      table += rowStart("highlight");
      table += cell("active");
    } else {
      table += rowStart("");
      table += cell("");
    }
    table += cell(phost->service_name);
    table += cell(String(phost->port));
    table += cell(phost->host_name);
    table += cell(ip_to_string(phost->address));
    table += cell(String(phost->service_valid_until));
    table += cell(String(phost->host_valid_until));
    table += cell(String(phost->ipv4_valid_until));
    table += cell(String(phost->sucess_counter) + " / " +
                  String(phost->sucess_counter + phost->fail_counter));

    table += rowEnd();
  }
  table += tableEnd();
  sucess &= bufferAppend(descriptionListItem("Brokers", table));
  
#ifdef DEBUG_STATISTICS
  if(mdns->packet_count != 0){
    sucess &= bufferAppend(descriptionListItem("&nbsp", "&nbsp"));
    sucess &= bufferAppend(descriptionListItem("mDNS decode success rate",
        String(mdns->packet_count - mdns->buffer_size_fail) + " / " + 
        String(mdns->packet_count) + "&nbsp&nbsp&nbsp" +
        String(100 - (100 * mdns->buffer_size_fail / mdns->packet_count)) + "%"));
    sucess &= bufferAppend(descriptionListItem("Largest mDNS packet size",
        String(mdns->largest_packet_seen) + " / " + 
        String(BUFFER_SIZE) + " bytes"));
  }
#endif

  sucess &= bufferAppend(descriptionListItem("&nbsp", "&nbsp"));
  sucess &= bufferAppend(descriptionListItem("Configure", link("go", "configure")));

  sucess &= bufferInsert(listStart());
  sucess &= bufferAppend(listEnd());
  
  sucess &= bufferInsert(pageHeader("style.css", ""));
  sucess &= bufferAppend(pageFooter());

  Serial.println(sucess);
  Serial.println("onRoot() -");
  esp8266_http_server.send((sucess ? 200 : 500), "text/html", buffer);
}

bool HttpServer::readFile(const String& filename){
	bool result = SPIFFS.begin();
  if(!result){
		Serial.println("Unable to use SPIFFS.");
    bufferAppend("Unable to use SPIFFS.");
    return false;
  }

	// this opens the file in read-mode
	File file = SPIFFS.open("/" + filename, "r");

	if (!file) {
		Serial.print("File doesn't exist: ");
    Serial.println(filename);
    bufferAppend("File doesn't exist: " + filename);

    return false;
  }

  while(file.available()) {
    //Lets read line by line from the file
    String line = file.readStringUntil('\n');
    strncat(buffer, line.c_str(), BUFFER_SIZE - strlen(buffer) -1);
  }

	file.close();


  return true;
}

const String HttpServer::mime(const String& filename){
  if(filename.endsWith(".css")){
    return "text/css";
  } else if(filename.endsWith(".js")){
    return "application/javascript";
  } else if(filename.endsWith(".htm") ||
            filename.endsWith(".html") ||
            filename.endsWith(".mustache"))
  {
    return "text/html";
  }
  return "text/plain";
}

void HttpServer::onConfig(){
  Serial.println("onConfig() +");
  bool sucess = true;
  bufferClear();

  if(*allow_config){
    (*allow_config)--;
  }
  if(*allow_config <= 0 && esp8266_http_server.hasArg("enablepassphrase") &&
      config->enable_passphrase != "" &&
      esp8266_http_server.arg("enablepassphrase") == config->enable_passphrase){
    *allow_config = 1;
  }
  Serial.print("allow_config: ");
  Serial.println(*allow_config);
  
  if(*allow_config){
    uint8_t mac[6];
    WiFi.macAddress(mac);
    sucess &= bufferAppend(descriptionListItem("mac_address", macToStr(mac)));
    
    if(config->ip == IPAddress(0, 0, 0, 0)) {
      sucess &= bufferAppend(descriptionListItem("IP address by DHCP",
                                     String(ip_to_string(WiFi.localIP()))));
    }
    sucess &= bufferAppend(descriptionListItem("hostname", 
        textField("hostname", "hostname", config->hostname, "hostname") +
        submit("Save", "save_hostname" , "save('hostname')")));
    sucess &= bufferAppend(descriptionListItem("&nbsp", "&nbsp"));

    sucess &= bufferAppend(descriptionListItem("IP address",
        ipField("ip", ip_to_string(config->ip), ip_to_string(config->ip), "ip") +
        submit("Save", "save_ip" , "save('ip')") +
        String("(0.0.0.0 for DHCP. Static boots quicker.)")));
    if(config->ip != IPAddress(0, 0, 0, 0)) {
      sucess &= bufferAppend(descriptionListItem("Subnet mask",
          ipField("subnet", ip_to_string(config->subnet), ip_to_string(config->subnet), "subnet") +
          submit("Save", "save_subnet" , "save('subnet')")));
      sucess &= bufferAppend(descriptionListItem("Gateway",
          ipField("gateway", ip_to_string(config->gateway),
            ip_to_string(config->gateway), "gateway") +
          submit("Save", "save_gateway" , "save('gateway')")));
    }
    sucess &= bufferAppend(descriptionListItem("&nbsp", "&nbsp"));

    sucess &= bufferAppend(descriptionListItem("Static MQTT broker ip",
        ipField("broker_ip", ip_to_string(config->broker_ip),
                ip_to_string(config->broker_ip), "brokerip") +
        submit("Save", "save_brokerip" , "save('brokerip')") +
        String("(0.0.0.0 to use mDNS auto discovery)")));
    sucess &= bufferAppend(descriptionListItem("Static MQTT broker port",
        portValue(config->broker_port, "brokerport") +
        submit("Save", "save_brokerport" , "save('brokerport')")));
    sucess &= bufferAppend(descriptionListItem("MQTT subscription prefix",
        textField("subscribeprefix", "subscribeprefix", config->subscribe_prefix,
          "subscribeprefix") +
        submit("Save", "save_subscribeprefix" , "save('subscribeprefix')")));
    sucess &= bufferAppend(descriptionListItem("MQTT publish prefix",
        textField("publishprefix", "publishprefix", config->publish_prefix,
          "publishprefix") +
        submit("Save", "save_publishprefix" , "save('publishprefix')")));
    sucess &= bufferAppend(descriptionListItem("&nbsp", "&nbsp"));
    
    sucess &= bufferAppend(descriptionListItem("HTTP Firmware host",
        textField("firmware_host", "firmware_host", config->firmware_host,
          "firmwarehost") +
        submit("Save", "save_firmwarehost" , "save('firmwarehost')")));
    sucess &= bufferAppend(descriptionListItem("HTTP Firmware directory",
        textField("firmware_directory", "firmware_directory", config->firmware_directory,
          "firmwaredirectory") +
        submit("Save", "save_firmwaredirectory" , "save('firmwaredirectory')")));
    sucess &= bufferAppend(descriptionListItem("HTTP Firmware port",
        portValue(config->firmware_port, "firmwareport") +
        submit("Save", "save_firmwareport" , "save('firmwareport')")));
    sucess &= bufferAppend(descriptionListItem("Config enable passphrase",
        textField("enable_passphrase", "enable_passphrase", config->enable_passphrase,
          "enablepassphrase") +
        submit("Save", "save_enablepassphrase" , "save('enablepassphrase')")));
    sucess &= bufferAppend(descriptionListItem("Config enable IO pin",
        ioPin(config->enable_io_pin, "enableiopin") +
        submit("Save", "save_enableiopin" , "save('enableiopin')")));


    sucess &= bufferAppend(tableStart());

